app/Http/Middleware/Session.php

    public function handle(Request $request, Closure $next)
    {

        if(!session()->has('lang')){
            $language = Language::whereStatus(ActiveDisable::active)->first();
            $value = $language ? $language->value : config('app.locale');
            session()->put('lang',$value);
        }

        if(setting('site.languages')){
            $languages = Language::oldest('status')->get();
        }else{
            $languages = Language::oldest('status')->take(1)->get();
---
select * from `languages` where `status` = 1 limit 1
select * from `languages` order by `status` asc limit 1