app/Models/Setting.php

    public static function set($key, $val, $type = 'string')
    {

        if ( $setting = self::getAllSettings()->where('name', $key)->first() ) {
            if(is_array($val) || is_object($val))
                $val = json_encode($val);
            return $setting->update([
                'name' => $key,
                'value' => $val]) ? $val : false;
---
update `settings` set `value` = 'Code', `settings`.`updated_at` = '2021-10-25 13:38:05' where `name` = 'site.name.vi'

    public static function getAllSettings()
    {

        return Cache::rememberForever('settings.all', function() {
            return self::where('autoload', 1)->get();
            //return collect(json_decode(self::all()->toJson()));
        });
---
select * from `settings` where `autoload` = 1