app/Http/Controllers/Admin/CustomerController.php

select * from `admins`
---
    public function index()
    {
        $this->authorize('contact');

        $admins = Admin::when(auth()->id() > 1, function ($q){
            $q->where('id','>', 1);
        })->get();