app/Http/Controllers/Admin/DashboardController.php

	public function index(){

            $star = now()->startOfMonth();
            $end = now()->endOfMonth();
            $month = CarbonPeriod::create($star,$end);
            $today = Carbon::today()->format('Y-m-d');
            $yesterday = Carbon::yesterday()->format('Y-m-d');

            $order = Order::selectRaw('DATE(created_at) as date, SUM(total) as total, SUM(revenue) as revenue')->whereBetween('created_at', [$star, $end])
                ->groupByRaw('date')
                ->get()->keyBy('date')->toArray();
---
select DATE(created_at) as date, SUM(total) as total, SUM(revenue) as revenue from `orders` where `created_at` between '2021-10-01 00:00:00' and '2021-10-31 23:59:59' group by date