app/Http/Controllers/Admin/GalleryController.php

select `name`, `email`, `id` from `admins`
---
    public function index()
    {
        $this->authorize('gallery.view');

        $admins = Admin::select('name','email','id')->when(auth()->id() > 1, function ($q){
            $q->where('id','>', 1);
        })->get();