app/Http/Controllers/Admin/MenuController.php

select `id` from `menus` where `position` = 'top' order by `sort` asc, `created_at` asc
---
    public function index()
    {
        $this->authorize('menu');

        $categories = Category::query()->with('translation', function ($q){
            $q->select('name','slug','category_id');
        })->public()->get();
        $pages = Post::query()->with('translation', function($q){
            $q->select('name','slug','post_id');
        })->whereType(PostType::page)->public()->get();
        $menus = Menu::query()->select('id','parent_id')->with('translation', function($q){
            $q->select('name','slug','menu_id');
        })->position()->sort()->get();

insert into `menus` (`path`, `parent_id`, `target`, `type`, `image`, `position`, `updated_at`, `created_at`) values ('', '0', '_self', 'default', '', 'top', '2021-10-25 13:54:09', '2021-10-25 13:54:09')
---
    public function store(Request $request)
    {
        $this->authorize('menu');

        $menu = new Menu();
        $menu->forceFill($request->data);
        $menu->save();

select * from `translations` where `translations`.`menu_id` = 2 and `translations`.`menu_id` is not null
---
    public function edit(Menu $menu)
    {
        $this->authorize('menu');

        $menus = Menu::query()->with('translation', function ($q) { $q->select('name','slug','menu_id');})
            ->where('id','!=', $menu->id)->position()->sort()->get();
        $translations = $menu->translations->load('language');

insert into `menus` (`position`, `updated_at`, `created_at`) values ('top', '2021-10-25 13:54:02', '2021-10-25 13:54:02')
---
    public function append(Request $request){
       $this->authorize('menu');

        $menu = new Menu();
        $menu->position  = session()->get('menu_position');
        $menu->save();