app/Http/Controllers/Admin/PhotoController.php

    public function index()
    {
       $this->authorize('media');

        $photos = Photo::when(request()->position, function($q, $position){
            $q->wherePosition($position);
        })->latest()->get();
---
select * from `photos` order by `created_at` desc