app/Http/Controllers/Admin/PostController.php

select * from `translations` where `translations`.`post_id` = 26 and `translations`.`post_id` is not null
---
    public function edit(Post $post)
    {
        $this->authorize('blog.edit');

        $categories = Category::query()->with('translation',function($q){
            $q->select('id','name','category_id');
        })->whereType(CategoryType::post)->public()->latest()->get();

        $translations = $post->translations->load('language');

select count(*) as aggregate from `translations` where `slug` = 'kjkhkhkjhkjhk' and `post_id` != 28
---
    public function update(UpdateTranslationRequest $request, Post $post)
    {
        $this->authorize('blog.edit');

        //translations
        foreach ($request->translation as $translation):
            //check slug
            if(Translation::whereSlug($translation['slug'])->where('post_id','!=', $post->id)->count())