app/Http/Controllers/Admin/PostController.php

select * from `categories` where `type` = 'post' and `public` = 1 order by `created_at` desc
---
    public function data(){

        $posts = Post::query()->with(['category' => function($q){
                $q->with('translation', function($q){
                    $q->select('id','name','slug','category_id');
                });
            }, 'admin','categories' => function($q){
                $q->with('translation');
            } , 'translation' => function($q){
                $q->select('name','slug','post_id');
            },'comments' => function($q){
                $q->select('id','comment_type','comment_id','rate');
            }])
            ->when(\request()->type,function ($q, $type){
                return $q->whereType($type);
            })
            ->when(request()->search, function ($q, $keyword){
                return $q->whereHas('translation',function ($q) use ($keyword){
                    return $q->where('id', $keyword)->orWhere('name', 'like', '%'.$keyword.'%')->orWhere('slug', 'like', '%'.$keyword.'%');
                });
            })
            ->when(\request()->author,function ($q, $author){
                return $q->whereAdminId($author);
            })
            ->when(request()->status, function ($q, $status){
                return $q->where('status', $status);
            })
            ->when(request()->public, function ($q, $public){
                return $q->wherePublic($public);
            })
            ->when(request()->category, function ($q, $category){
                $q->where('category_id',$category)
                    ->orwhereHas('categories' , function ($q) use ($category) {
                        $q->whereCategoryId($category);
                    });
            });