app/Http/Controllers/Admin/PostCategoryController.php

    public function create(){
        $this->authorize('blog.create');

        $categories = Category::whereType(CategoryType::post)->withTranslation()->latest()->get();
---
select * from `categories` where `type` = 'post' order by `created_at` desc

    public function edit(Category $category){
        $this->authorize('blog.edit');

        $categories = Category::whereType($category->type)->whereNotIn('id',[$category->id])->withTranslation()->public()->latest()->get();

        $translations = $category->translations->load('language');
---
select * from `categories` where `type` = 'post' and `id` not in (5) and `public` = 1 order by `created_at` desc
select * from `translations` where `translations`.`category_id` = 5 and `translations`.`category_id` is not null