app/Http/Controllers/Admin/ProductCategoryController.php

    public function create()
    {
        $this->authorize('product.create');
        $categories = Category::whereType(CategoryType::product)->withTranslation()->latest()->get();
---
select * from `categories` where `type` = 'product' order by `created_at` desc