app/Http/Controllers/Admin/ProductController.php

select `id`, `name`, `email` from `admins`
---
    public function index()
    {
        $this->authorize('product.view');

        $categories = Category::query()->with('translation', function($q){
            $q->select('id','name','category_id');
        })->whereType(CategoryType::product)->public()->latest()->get();

        $admins = Admin::query()->select('id','name','email')->when(auth()->id() > 1, function ($q){
            $q->where('id','>', 1);
        })->get();

select * from `categories` where `type` = 'product' and `public` = 1 order by `created_at` desc
select * from `attributes` order by `sort` asc
---
    public function create()
    {
        $this->authorize('product.create');

        $categories = Category::with('translation')->whereType(CategoryType::product)->public()->latest()->get();
        $attributes = Attribute::oldest('sort')->withTranslation()->get();

insert into `products` (`code`, `price`, `price_sale`, `public`, `category_id`, `type`, `admin_id`, `updated_at`, `created_at`) values ('MWHFVYQ', '0', '0', '1', '3', 'product', 1, '2021-10-25 14:19:36', '2021-10-25 14:19:36')
---
            $product->video = str_replace('https://www.youtube.com/watch?v=','',$request->input('data.video'));
        }

        $product->save();

select * from `categories` where `type` = 'product' and `public` = 1 order by `created_at` desc
select * from `attributes` order by `sort` asc
---
    public function edit(Product $product)
    {
        if(auth()->id() > 1) $this->authorize('product.edit');

        $categories = Category::with('translation')->whereType(CategoryType::product)->public()->latest()->get();
        $attributes = Attribute::oldest('sort')->withTranslation()->get();