app/Http/Controllers/Admin/RoleController.php

    public function data(){
        $roles = Role::query()->when(auth()->id() > 1, function ($q){
            return $q->where('id','>',1);
        })->when(\request()->search,function ($q,$search){
            return $q->where('name','like',"%{$search}%");
        });

        return datatables()->of($roles)
            ->editColumn('permission',function ($role){
                return $role->permissions->pluck('title')->toArray();
---
select `permissions`.*, `role_has_permissions`.`role_id` as `pivot_role_id`, `role_has_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_has_permissions` on `permissions`.`id` = `role_has_permissions`.`permission_id` where `role_has_permissions`.`role_id` = 1

    public function edit(Role $role)
    {
        if(auth()->id() > 1) $this->authorize('role.edit');
        $permissions = Permission::all();
---
select * from `permissions`