app/Http/Controllers/Admin/SupportController.php

select * from `admins`
---
    public function index()
    {
        $this->authorize('contact');

        $admins = Admin::when(auth()->id() > 1, function ($q){
            $q->where('id','>', 1);
        })->get();

select * from `translations` where `translations`.`support_id` = 1 and `translations`.`support_id` is not null
---
    public function edit(Support $support)
    {
        $this->authorize('contact');
        $translations = $support->translations->load('language');