app/Http/Controllers/Admin/VideoController.php

	public function index(){

	    $this->authorize('video.view');

        $admins = Admin::query()->select('id','name','email')->when(auth()->id() > 1, function ($q){
            $q->where('id','>', 1);
        })->get();
---
select `id`, `name`, `email` from `admins`